'''
> P
정수 N을 1,2,3의 합으로 나타내는 바법의 수를 구하라
> S
동적 계획법

ai =
'''
MAX = 1000001

t = int(input())
n = [int(input()) for _ in range(t)]

dp = [[0 for _ in range(3)] for _ in range(MAX)]
dp[1] = [1, 0, 0]   # [1][0] = 1, 나머지는 0 => 1을 만들기 위한 식 중 맨 뒤가 1인건 1가지(0+1)
dp[2] = [0, 1, 0]   # [2][1] = 1, => 0+2, 1가지 경우
dp[3] = [1, 1, 1]   # [3][0] => 2+1 // [3][1]  => 1+2 // [3][2] => 0+3

for i in range(4, MAX):
    dp[i][0] = dp[i-1][1] % 1000000009 + dp[i-1][2] % 1000000009
    dp[i][1] = dp[i-2][0] % 1000000009 + dp[i-2][2] % 1000000009
    dp[i][2] = dp[i-3][0] % 1000000009 + dp[i-3][1] % 1000000009

for i in n:
    print(sum(dp[i]) % 1000000009)
